# GlazingReflectance Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Glazing..::..GlazingReflectance Property
Glazing Class See Also
---
The property labeled "Reflectance" from the "Glazing" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string GlazingReflectance { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GlazingReflectance As String
	Get
```

Visual C++
---
```text
public:
static property String^ GlazingReflectance {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1".
# See Also
Glazing Class
Autodesk.Revit.DB.Visual Namespace